{"backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "batch_input_shape": [null, 64, 64, 3], "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_constraint": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "name": "conv2d_1", "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "dtype": "float32", "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "name": "conv2d_2", "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "units": 128, "activation": "relu"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "activity_regularizer": null, "bias_regularizer": null, "units": 1, "activation": "sigmoid"}}], "name": "sequential_1"}, "keras_version": "2.3.1"}