{"backend": "tensorflow", "config": {"layers": [{"config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "dtype": "float32", "kernel_constraint": null, "name": "dense_1", "batch_input_shape": [null, 13], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 13}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "dtype": "float32", "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "exponential", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 1}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "dtype": "float32", "kernel_constraint": null, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 13}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.3.1"}