{"class_name": "Sequential", "keras_version": "2.3.1", "config": {"layers": [{"class_name": "Conv2D", "config": {"filters": 32, "kernel_size": [3, 3], "batch_input_shape": [null, 64, 64, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "dtype": "float32", "name": "conv2d_1", "bias_constraint": null, "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"filters": 32, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "valid", "use_bias": true, "name": "conv2d_2", "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"dtype": "float32", "name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "name": "dense_1", "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "activation": "relu", "trainable": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "name": "dense_2", "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true, "activity_regularizer": null}}], "name": "sequential_1"}, "backend": "tensorflow"}