{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"bias_regularizer": null, "units": 13, "bias_constraint": null, "dtype": "float32", "kernel_regularizer": null, "name": "dense_1", "activity_regularizer": null, "batch_input_shape": [null, 13], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "trainable": true, "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "trainable": true, "bias_constraint": null, "dtype": "float32", "kernel_regularizer": null, "name": "dense_2", "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "units": 1, "kernel_constraint": null, "activation": "exponential"}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "trainable": true, "bias_constraint": null, "dtype": "float32", "kernel_regularizer": null, "name": "dense_3", "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "units": 13, "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}]}, "keras_version": "2.3.1", "class_name": "Sequential"}