{"keras_version": "2.3.1", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"name": "dense_1", "activation": "linear", "activity_regularizer": null, "units": 3, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 3], "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "activation": "linear", "activity_regularizer": null, "units": 2, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_3", "activation": "linear", "activity_regularizer": null, "units": 3, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}